In [35]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [36]:
df_bici = pd.read_csv('datos_abiertos_2014_12.csv')
df_estaciones = pd.read_csv('nomenclatura_2022_08.csv', encoding = "ISO-8859-1")
df_bici.head()

,Viaje_Id,Usuario_Id,Genero,Año_de_nacimiento,Inicio_del_viaje,Fin_del_viaje,Origen_Id,Destino_Id
0,4601,10324,M,NaN,2014-12-01 00:33:47,2014-12-01 00:36:54,47,47
1,4604,10324,M,NaN,2014-12-01 01:06:54,2014-12-01 01:08:45,5,5
2,4628,3,F,1990.0,2014-12-01 09:47:20,2014-12-01 09:47:47,79,79
3,4631,102,M,1982.0,2014-12-01 09:48:23,2014-12-01 09:48:37,79,79
4,4632,3,F,1990.0,2014-12-01 09:48:46,2014-12-01 09:48:57,79,79

In [37]:
df_estaciones.head()

,id,name,obcn,location,latitude,longitude,status
0,2,(GDL-001) C. Epigmenio Glez./ Av. 16 de Sept.,GDL-001,POLÍGONO CENTRAL,20.666378,-103.348820,IN_SERVICE
1,3,(GDL-002) C. Colonias / Av. Niños héroes,GDL-002,POLÍGONO CENTRAL,20.667228,-103.366000,IN_SERVICE
2,4,(GDL-003) C. Vidrio / Av. Chapultepec,GDL-003,POLÍGONO CENTRAL,20.667690,-103.368252,IN_SERVICE
3,5,(GDL-004) C. Ghilardi /C. Miraflores,GDL-004,POLÍGONO CENTRAL,20.691750,-103.362550,IN_SERVICE
4,6,(GDL-005) C. San Diego /Calzada Independencia,GDL-005,POLÍGONO CENTRAL,20.681151,-103.338863,IN_SERVICE

In [38]:
df_bici.isnull().sum()

Viaje_Id               0
Usuario_Id             0
Genero                 5
Año_de_nacimiento    220
Inicio_del_viaje       0
Fin_del_viaje          0
Origen_Id              0
Destino_Id             0
dtype: int64

In [39]:
df_bici.describe()

,Viaje_Id,Usuario_Id,Año_de_nacimiento,Origen_Id,Destino_Id
count,23967.000000,23967.000000,23747.000000,23967.000000,23967.000000
mean,24274.527350,8364.778988,1981.969301,47.597864,47.228523
std,10237.985577,5261.300723,9.815592,23.652728,23.422110
min,4601.000000,3.000000,1944.000000,2.000000,2.000000
25%,15860.500000,3622.000000,1977.000000,28.000000,29.000000
50%,24394.000000,7516.000000,1984.000000,50.000000,50.000000
75%,32876.500000,12749.500000,1989.000000,66.000000,66.000000
max,42033.000000,20342.000000,1998.000000,88.000000,88.000000

In [40]:
from math import floor
df_bici['Año_de_nacimiento'] = df_bici['Año_de_nacimiento'].fillna(floor(df_bici['Año_de_nacimiento'].mean()))

In [41]:
df_bici = df_bici.dropna()

In [42]:
df_bici.isnull().sum()

Viaje_Id             0
Usuario_Id           0
Genero               0
Año_de_nacimiento    0
Inicio_del_viaje     0
Fin_del_viaje        0
Origen_Id            0
Destino_Id           0
dtype: int64

In [43]:
for i in range(len(df_estaciones.obcn)):
    df_estaciones.obcn[i] = i+1

/tmp/ipykernel_24743/1218156629.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_estaciones.obcn[i] = i+1